<template>	
	<div style="height: 750px; overflow-y: scroll;">
		<b-table striped hover :items="items" :fields="fields"/>  
	</div> 	
</template>
<script>
	export default {
		data(){
			return {
				fields:[
					{
						key:'Дата',
						sortable:true
					},
					{
						key:'Приход',
						sortable:true
					},
					{
						key:'Расход',
						sortable:true
					},
					{
						key:'Остаток',
						sortable:true
					},
					{
						key:'День_недели',
						sortable:false
					},
				],
				items:[
					{Дата:'01.10.2018', Приход:'1000', Расход:'100', Остаток:'900', День_недели:'Понедельник'},
					{Приход:'0', Расход:'200', Дата:'02.10.2018',Остаток:'700', День_недели:'Вторник'},
					{Дата:'01.10.2018', Приход:'1000', Расход:'100', Остаток:'900', День_недели:'Понедельник'},
					{Приход:'0', Расход:'200', Дата:'02.10.2018',Остаток:'700', День_недели:'Вторник'},
					{Дата:'01.10.2018', Приход:'1000', Расход:'100', Остаток:'900', День_недели:'Понедельник'},
					{Приход:'0', Расход:'200', Дата:'02.10.2018',Остаток:'700', День_недели:'Вторник'},
					{Дата:'01.10.2018', Приход:'1000', Расход:'100', Остаток:'900', День_недели:'Понедельник'},
					{Приход:'0', Расход:'200', Дата:'02.10.2018',Остаток:'700', День_недели:'Вторник'},
					{Дата:'01.10.2018', Приход:'1000', Расход:'100', Остаток:'900', День_недели:'Понедельник'},
					{Приход:'0', Расход:'200', Дата:'02.10.2018',Остаток:'700', День_недели:'Вторник'},
					{Дата:'01.10.2018', Приход:'1000', Расход:'100', Остаток:'900', День_недели:'Понедельник'},
					{Приход:'0', Расход:'200', Дата:'02.10.2018',Остаток:'700', День_недели:'Вторник'},
					{Дата:'01.10.2018', Приход:'1000', Расход:'100', Остаток:'900', День_недели:'Понедельник'},
					{Приход:'0', Расход:'200', Дата:'02.10.2018',Остаток:'700', День_недели:'Вторник'},
					{Дата:'01.10.2018', Приход:'1000', Расход:'100', Остаток:'900', День_недели:'Понедельник'},
					{Приход:'0', Расход:'200', Дата:'02.10.2018',Остаток:'700', День_недели:'Вторник'},
					{Дата:'01.10.2018', Приход:'1000', Расход:'100', Остаток:'900', День_недели:'Понедельник'},
					{Приход:'0', Расход:'200', Дата:'02.10.2018',Остаток:'700', День_недели:'Вторник'},
					{Дата:'01.10.2018', Приход:'1000', Расход:'100', Остаток:'900', День_недели:'Понедельник'},
					{Приход:'0', Расход:'200', Дата:'02.10.2018',Остаток:'700', День_недели:'Вторник'},
					{Дата:'01.10.2018', Приход:'1000', Расход:'100', Остаток:'900', День_недели:'Понедельник'},
					{Приход:'0', Расход:'200', Дата:'02.10.2018',Остаток:'700', День_недели:'Вторник'}
				]
			}
		}
	};
</script>
<style scoped>
	.b-table {
		position:relative;
		height: 500px;
		overflow-y: hidden;
	}
</style>
<!-- <table id="mainTable" class="table table-striped mt-2">
					<thead class="thead-primary">
						<tr>
							<th><b>Дата</b></th>
							<th><b>Приход</b></th>
							<th><b>Расход</b></th>
							<th><b>Остаток</b></th>
							<th><b>День недели</b></th>
						</tr>
					</thead>
					<tbody id="tableMain">
					</tbody>        
				</table> -->