<template>
  <v-data-table
    :headers="headers"
    :items="items"
    :search="search"
    :rows-per-page-items="rowsPerPageItemsArray"
    :rows-per-page-text="text"
    no-data-text="нет данных"
    no-results-text="нет данных"
  >
    <template slot="items" slot-scope="props">
      <td class="text-xm-center">{{ props.item.Дата }}</td>
      <td class="text-xm-center">{{ props.item.Приход }}</td>
      <td class="text-xm-center">{{ props.item.Расход }}</td>
      <td class="text-xm-center">{{ props.item.Остаток }}</td>
      <td class="text-xm-center">{{ props.item.День_недели }}</td>
    </template>
  </v-data-table>
</template>
<script>
import eventbus from "../plugins/eventbus.js";
export default {
  created() {
    eventbus.$on("searchReq", this.searchData);
  },
  methods: {
    searchData(value) {
      this.search = value;
    }
  },
  data() {
    return {
      search: "",
      text: "Строк на странице:",
      rowsPerPageItemsArray: [15, 45, 90, { text: "Все", value: -1 }],
      headers: [
        {
          text: "Дата",
          value: "Дата",
          sortable: true
        },
        {
          text: "Приход",
          value: "Приход",
          sortable: true
        },
        {
          text: "Расход",
          value: "Расход",
          sortable: true
        },
        {
          text: "Остаток",
          value: "Остаток",
          sortable: true
        },
        {
          text: "День недели",
          value: "День_недели",
          sortable: false
        }
      ],
      items: [
        {
          Дата: "01.10.2018",
          Приход: "1000",
          Расход: "100",
          Остаток: "900",
          День_недели: "Понедельник"
        },
        {
          Приход: "0",
          Расход: "200",
          Дата: "02.10.2018",
          Остаток: "700",
          День_недели: "Вторник"
        },
        {
          Дата: "01.10.2018",
          Приход: "1000",
          Расход: "100",
          Остаток: "900",
          День_недели: "Понедельник"
        },
        {
          Приход: "0",
          Расход: "200",
          Дата: "02.10.2018",
          Остаток: "700",
          День_недели: "Вторник"
        },
        {
          Дата: "01.10.2018",
          Приход: "1000",
          Расход: "100",
          Остаток: "900",
          День_недели: "Понедельник"
        },
        {
          Приход: "0",
          Расход: "200",
          Дата: "02.10.2018",
          Остаток: "700",
          День_недели: "Вторник"
        },
        {
          Дата: "01.10.2018",
          Приход: "1000",
          Расход: "100",
          Остаток: "900",
          День_недели: "Понедельник"
        },
        {
          Приход: "0",
          Расход: "200",
          Дата: "02.10.2018",
          Остаток: "700",
          День_недели: "Вторник"
        },
        {
          Дата: "01.10.2018",
          Приход: "1000",
          Расход: "100",
          Остаток: "900",
          День_недели: "Понедельник"
        },
        {
          Приход: "0",
          Расход: "200",
          Дата: "02.10.2018",
          Остаток: "700",
          День_недели: "Вторник"
        },
        {
          Дата: "01.10.2018",
          Приход: "1000",
          Расход: "100",
          Остаток: "900",
          День_недели: "Понедельник"
        },
        {
          Приход: "0",
          Расход: "200",
          Дата: "02.10.2018",
          Остаток: "700",
          День_недели: "Вторник"
        },
        {
          Дата: "01.10.2018",
          Приход: "1000",
          Расход: "100",
          Остаток: "900",
          День_недели: "Понедельник"
        },
        {
          Приход: "0",
          Расход: "200",
          Дата: "02.10.2018",
          Остаток: "700",
          День_недели: "Вторник"
        },
        {
          Дата: "01.10.2018",
          Приход: "1000",
          Расход: "100",
          Остаток: "900",
          День_недели: "Понедельник"
        },
        {
          Приход: "0",
          Расход: "200",
          Дата: "02.10.2018",
          Остаток: "700",
          День_недели: "Вторник"
        },
        {
          Дата: "01.10.2018",
          Приход: "1000",
          Расход: "100",
          Остаток: "900",
          День_недели: "Понедельник"
        },
        {
          Приход: "0",
          Расход: "200",
          Дата: "02.10.2018",
          Остаток: "700",
          День_недели: "Вторник"
        },
        {
          Дата: "01.10.2018",
          Приход: "1000",
          Расход: "100",
          Остаток: "900",
          День_недели: "Понедельник"
        },
        {
          Приход: "0",
          Расход: "200",
          Дата: "02.10.2018",
          Остаток: "700",
          День_недели: "Вторник"
        },
        {
          Дата: "01.10.2018",
          Приход: "1000",
          Расход: "100",
          Остаток: "900",
          День_недели: "Понедельник"
        },
        {
          Приход: "0",
          Расход: "200",
          Дата: "02.10.2018",
          Остаток: "700",
          День_недели: "Вторник"
        },
        {
          Дата: "01.10.2018",
          Приход: "1000",
          Расход: "100",
          Остаток: "900",
          День_недели: "Понедельник"
        },
        {
          Приход: "0",
          Расход: "200",
          Дата: "02.10.2018",
          Остаток: "700",
          День_недели: "Вторник"
        },
        {
          Дата: "01.10.2018",
          Приход: "1000",
          Расход: "100",
          Остаток: "900",
          День_недели: "Понедельник"
        },
        {
          Приход: "0",
          Расход: "200",
          Дата: "02.10.2018",
          Остаток: "700",
          День_недели: "Вторник"
        },
        {
          Дата: "01.10.2018",
          Приход: "1000",
          Расход: "100",
          Остаток: "900",
          День_недели: "Понедельник"
        },
        {
          Приход: "0",
          Расход: "200",
          Дата: "02.10.2018",
          Остаток: "700",
          День_недели: "Вторник"
        },
        {
          Дата: "01.10.2018",
          Приход: "1000",
          Расход: "100",
          Остаток: "900",
          День_недели: "Понедельник"
        },
        {
          Приход: "0",
          Расход: "200",
          Дата: "02.10.2018",
          Остаток: "700",
          День_недели: "Вторник"
        },
        {
          Дата: "01.10.2018",
          Приход: "1000",
          Расход: "100",
          Остаток: "900",
          День_недели: "Понедельник"
        },
        {
          Приход: "0",
          Расход: "200",
          Дата: "02.10.2018",
          Остаток: "700",
          День_недели: "Вторник"
        },
        {
          Дата: "01.10.2018",
          Приход: "1000",
          Расход: "100",
          Остаток: "900",
          День_недели: "Понедельник"
        },
        {
          Приход: "0",
          Расход: "200",
          Дата: "02.10.2018",
          Остаток: "700",
          День_недели: "Вторник"
        },
        {
          Дата: "01.10.2018",
          Приход: "1000",
          Расход: "100",
          Остаток: "900",
          День_недели: "Понедельник"
        },
        {
          Приход: "0",
          Расход: "200",
          Дата: "02.10.2018",
          Остаток: "700",
          День_недели: "Вторник"
        },
        {
          Дата: "01.10.2018",
          Приход: "1000",
          Расход: "100",
          Остаток: "900",
          День_недели: "Понедельник"
        },
        {
          Приход: "0",
          Расход: "200",
          Дата: "02.10.2018",
          Остаток: "700",
          День_недели: "Вторник"
        },
        {
          Дата: "01.10.2018",
          Приход: "1000",
          Расход: "100",
          Остаток: "900",
          День_недели: "Понедельник"
        },
        {
          Приход: "0",
          Расход: "200",
          Дата: "02.10.2018",
          Остаток: "700",
          День_недели: "Вторник"
        },
        {
          Дата: "01.10.2018",
          Приход: "1000",
          Расход: "100",
          Остаток: "900",
          День_недели: "Понедельник"
        },
        {
          Приход: "0",
          Расход: "200",
          Дата: "02.10.2018",
          Остаток: "700",
          День_недели: "Вторник"
        },
        {
          Дата: "01.10.2018",
          Приход: "1000",
          Расход: "100",
          Остаток: "900",
          День_недели: "Понедельник"
        },
        {
          Приход: "0",
          Расход: "200",
          Дата: "02.10.2018",
          Остаток: "700",
          День_недели: "Вторник"
        }
      ]
    };
  }
};
</script>
<style>
/*tbody {
 	margin-top: 20px;
    background: red;
    height: 700px;
    overflow-y: scroll;
}
thead {
	background: green;
	position: fixed;
}
.theme--dark.v-datatable .v-datatable__actions {
	background: blue;
	position: fixed;
}*/
/** {
	background: white;
}*/
</style>
